submission/app/services/application_engine.rb

SELECT "applications".* FROM "applications" WHERE "applications"."position_id" = $1  [["position_id", 4]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def initialize(position_id, user_id)
    @position = Position.includes(:applications).find(position_id)
    @user = User.find(user_id)

INSERT INTO "applications" ("position_id", "user_id", "created_at", "updated_at", "resume") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["position_id", 4], ["user_id", 1], ["created_at", "2020-09-10 20:32:29.921547"], ["updated_at", "2020-09-10 20:32:29.921547"], ["resume", "great employee 0"]]
---
  def create_application(application_params)
    app = Application.new(application_params)
    app.user = @user
    app.position = @position
    app.save!