submission/lib/tasks/run_job_campaign.rake

INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test company"], ["created_at", "2020-09-10 20:31:11.197208"], ["updated_at", "2020-09-10 20:31:11.197208"]]
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test company"], ["created_at", "2020-09-10 20:30:54.388416"], ["updated_at", "2020-09-10 20:30:54.388416"]]
INSERT INTO "positions" ("description", "company_id", "application_limit", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "A great job"], ["company_id", 2], ["application_limit", 10], ["created_at", "2020-09-10 20:31:11.243667"], ["updated_at", "2020-09-10 20:31:11.243667"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "User 0"], ["created_at", "2020-09-10 20:39:33.802697"], ["updated_at", "2020-09-10 20:39:33.802697"]]
SELECT COUNT(*) FROM "applications" WHERE "applications"."position_id" = $1  [["position_id", 2]]
---
task :run_campaign, [:num_openings, :num_applications] => [:environment] do |t, args|
  if args.num_openings.present? && args.num_applications.present?
    company = Company.create(name: 'test company')
    position = Position.create(company_id: company.id, description: 'A great job', application_limit: args.num_openings)

    args.num_applications.to_i.times do |i|
      i += 1
      user = User.create(name: "User #{i}")
      app_engine = ApplicationEngine.new(position.id, user.id)
      result = app_engine.submit_application({ resume: "great employee #{i}" })
      if result
        puts "You have successfully applied to this position, #{user.name}"
      else
        puts "Sorry #{user.name}, but this job campaign is now closed"
      end
    end
    puts "#{position.applications.count} applications have been accepted for the position"